{
    "thread_url": "https://reddit.com/r/AmItheAsshole/comments/140w67v/aita_for_making_my_brotherinlaw_pay_for_his_sons/",
    "thread_title": "AITA: breaking up with my partner because they don't do any chores?",
    "thread_id": "140w67v",
    "is_nsfw": false,
    "comments": [],
    "thread_post": [
      "I (28F) am at my wit's end with my partner (30M) and their lack of contribution to our household chores. ",
      "I've reached a breaking point and I need your perspective on whether I'm being unreasonable.",
      "For the past two years, it feels like I've been carrying the burden of cleaning, cooking, and taking care of all the household tasks on my own. ",
      "Despite multiple discussions about the issue, my partner continues to neglect their responsibilities, leaving me overwhelmed and exhausted.",
      "I've tried to address the problem calmly and reasonably, expressing my feelings and asking for their help. ",
      "However, every time I bring it up, my partner becomes defensive and tries to deflect the blame onto me. ",
      "They argue that they're already doing their fair share, but in reality, their efforts are minimal and sporadic at best.",
      "I'm the one who constantly has to scrub the floors, do the laundry, and ensure that the house is in order. ",
      "Meanwhile, my partner thinks that occasionally taking out the trash and half-heartedly washing a few dishes is enough to make up for it. ",
      "It's frustrating and insulting to see their lack of effort while I'm juggling a demanding job as well. ",
      "When I explain the mental and emotional toll that comes with managing a household, they brush it off and accuse me of exaggerating. ",
      "They don't understand the constant planning, organizing, and stress that I go through on a daily basis just to keep our home functioning smoothly.",
      "At this point, I'm filled with resentment and anger. ",
      "I feel like I'm being taken for granted and my needs are being disregarded. ",
      "I've reached a breaking point where I'm contemplating whether I should continue in this relationship or demand change. ",
      "So, Reddit, I turn to you for judgment. ",
      "Am I the asshole for expecting my lazy partner to finally pull their weight and contribute equally to our household chores? ",
      "Or am I justified in demanding change and considering the future of our relationship?",
      "TL;DR: My partner neglects their responsibilities and expects me to handle all the household chores. ",
      "Despite multiple discussions, they dismiss my concerns and refuse to contribute equally. ",
      "Am I the asshole for demanding change and considering the future of our relationship?"
    ]
}